bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
void hidden_start_loaded_program(void) {
  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
}

void hidden_return_to_program_start(void) {
  hidden_rewind_count++;
}

void MK61Emu_ClearCodePage(void) {
  clear_count++;
}

void reinit_mk61_calculator_state(void) {
  reinit_count++;
  m_IK1302.comma = 0;
}

u32 m61_text_host_millis(void) {
  return fake_millis;
}

bool OpenStoredFile(const char* name) {
  return m61_text::open_program(name);
}

namespace terminal_script {

void reset(void) {}

terminal_protocol::Result execute(const char* line, bool trap_mode) {
  executed_commands++;
  executed_lines.emplace_back(line);
  executed_in_trap.push_back(trap_mode);
  if(std::strcmp(line, "print on") == 0) {
    m61_text::release_display();
    return terminal_protocol::Result::ok();
  }
  if(std::strncmp(line, "print ", 6) == 0) {
    m61_text::claim_display();
    return terminal_protocol::Result::ok();
  }
  if(std::strcmp(line, "wait 500") == 0) {
    return terminal_protocol::Result::wait(500);
  }
  if(std::strcmp(line, "bad") == 0) return terminal_protocol::Result::error();
  if(std::strcmp(line, "measure") == 0) {
    return terminal_protocol::Result::action(
        terminal_protocol::ResultKind::MEASURE_NEXT_RUN, "");
  }
  if(std::strcmp(line, "run") == 0) return terminal_protocol::Result::action(terminal_protocol::ResultKind::RUN_PROGRAM, "");
  if(std::strncmp(line, "run :", 5) == 0) {
    return terminal_protocol::Result::action(terminal_protocol::ResultKind::GOTO_LABEL, line + 5);
  }
  if(std::strncmp(line, "open ", 5) == 0) {
    return terminal_protocol::Result::action(terminal_protocol::ResultKind::OPEN_FILE, line + 5);
  }
  if(std::strcmp(line, "ret") == 0) {
    return terminal_protocol::Result::action(
        terminal_protocol::ResultKind::RETURN_SCRIPT, "");
  }
  if(std::strcmp(line, "reinit") == 0) {
    return terminal_protocol::Result::action(
        terminal_protocol::ResultKind::REINIT_CALCULATOR, "");
  }
  return terminal_protocol::Result::ok();
}

} // пространство имён terminal_script

static void reset_host(void) {
  m61_text::cancel();
  assert((u8) core_61::context_buffer_owner == 0);
  scripts.clear();
  range_reads = 0;
  executed_commands = 0;
  clear_count = 0;
  active_program_steps = core_61::CLASSIC_PROGRAM_STEP;
  boundary_hook = nullptr;
  boundary_user_data = nullptr;
  command_hooks.clear();
  next_command_hook = 1;
  command_sequence = 0;
  context_saves = 0;
  context_restores = 0;
  reinit_count = 0;
  hidden_rewind_count = 0;
  host_angle_unit = DEGREE;
  saved_context_angle = DEGREE;
  fake_millis = 0;
  executed_lines.clear();
  executed_in_trap.clear();
  m_IK1302.comma = 0;
}

static void add_script(const char* name, const std::string& source,
                       u16 parent_id = program_store::ROOT_ID) {
  scripts.push_back({name, source, parent_id});
}

static m61_text::Error require_error(void) {
  m61_text::Error error = {};
  assert(m61_text::last_error(error));
  return error;
}

static bool fire_program_boundary(u8 address, u8 opcode = 0) {
  assert(boundary_hook != nullptr);
  const core_61::Mk61ProgramBoundaryContext context = {address, opcode};
  return boundary_hook(context, boundary_user_data);
}

static u8 fire_mk61_command(
    u8 opcode,
    core_61::Mk61CommandSource source =
        core_61::Mk61CommandSource::KEYBOARD) {
  command_sequence++;
  core_61::Mk61CommandHookContext before = {
    core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
    source,
    opcode,
    opcode,
    command_sequence
  };
  for(HostCommandHook& hook : command_hooks) {
    if(hook.opcode == opcode &&
       hook.phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE) {
      hook.callback(before, hook.user_data);
    }
  }

  core_61::Mk61CommandHookContext after = {
    core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
    source,
    opcode,
    before.replacement_opcode,
    command_sequence
  };
  for(HostCommandHook& hook : command_hooks) {
    if(hook.opcode == opcode &&
       hook.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE) {
      hook.callback(after, hook.user_data);
    }
  }
  return before.replacement_opcode;
}

static void test_command_failure_reports_script_and_line(void) {
  reset_host();
  add_script("FAIL", "ok\nbad\nok\n");
  assert(!m61_text::load_program("FAIL"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "FAIL") == 0);
  assert(error.line == 2);
  assert(std::strcmp(error.message, "terminal command failed") == 0);
  assert(!m61_text::active());
  assert(executed_commands == 2);
}

static void test_long_missing_name_is_truncated_to_error_capacity(void) {
  reset_host();
  const char* name = "1234567890123456789012345678901";
  assert(std::strlen(name) == program_store::NAME_SIZE - 1);
  assert(!m61_text::load_program(name));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "123456789012345") == 0);
  assert(error.line == 0);
  assert(std::strcmp(error.message, "script not found") == 0);
}

static void test_duplicate_and_oversized_labels_fail_before_execution(void) {
  reset_host();
  add_script("DUP", ":same\n:same\nok\n");
  assert(!m61_text::load_program("DUP"));
  m61_text::Error error = require_error();
  assert(error.line == 2);
  assert(std::strcmp(error.message, "duplicate label") == 0);
  assert(executed_commands == 0);

  reset_host();
  add_script("LONG", ":abcdefghijklmnopqrstuvwxyz123456\nok\n");
  assert(!m61_text::load_program("LONG"));
  error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "invalid label") != nullptr);
}

static void test_line_limit_is_enforced_during_indexing(void) {
  reset_host();
  add_script("LINE", std::string(terminal_core::MAX_INPUT_TEXT + 1, 'x') + "\n");
  assert(!m61_text::load_program("LINE"));
  const m61_text::Error error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "line is too long") != nullptr);
}

static void test_indexed_loop_is_budgeted_and_uses_block_reads(void) {
  reset_host();
  std::string source;
  for(int i = 0; i < 200; i++) source += "\n";
  source += ":loop\nrun :loop\n";
  add_script("LOOP", source);

  assert(m61_text::load_program("LOOP"));
  assert(m61_text::active());
  for(int i = 0; i < 32; i++) {
    const int before = executed_commands;
    m61_text::service();
    assert(executed_commands - before <= 8);
  }
  assert(executed_commands > 8);
  assert(range_reads < 200); // старому исполнителю здесь требовались тысячи однобайтовых чтений
  m61_text::cancel();
}

static void test_label_reference_rejects_trailing_tokens(void) {
  reset_host();
  add_script("ARGS", ":loop\nrun :loop extra\n");
  assert(!m61_text::load_program("ARGS"));
  const m61_text::Error error = require_error();
  assert(error.line == 2);
}

static void test_run_waits_and_reports_later_failure(void) {
  reset_host();
  add_script("WAIT", "run\nbad\n");
  assert(m61_text::load_program("WAIT"));
  assert(m61_text::active());
  assert(executed_commands == 1);

  m61_text::service();
  assert(executed_commands == 1); // калькулятор всё ещё работает
  m_IK1302.comma = 0;
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "WAIT") == 0);
  assert(error.line == 2);
}

static void test_measure_arms_next_manual_run_after_script_finishes(void) {
  reset_host();
  add_script("FACTORIAL", "measure\n");
  assert(m61_text::load_program("FACTORIAL"));
  assert(!m61_text::active());
  assert(hidden_rewind_count == 1);
  assert(run_measurement::state() == run_measurement::State::ARMED);

