bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
  assert(run_measurement::program_started(100U));
  u32 elapsed = 0;
  assert(run_measurement::program_stopped(325U, elapsed));
  assert(elapsed == 225U);
  assert(run_measurement::state() == run_measurement::State::IDLE);
}

static void test_measure_preceding_run_starts_at_the_run_boundary(void) {
  reset_host();
  fake_millis = 700U;
  add_script("AUTO", "measure\nrun\nret\n");
  assert(m61_text::load_program("AUTO"));
  assert(m61_text::active());
  assert(hidden_rewind_count == 1);
  assert(run_measurement::state() == run_measurement::State::RUNNING);

  fake_millis = 950U;
  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  u32 elapsed = 0;
  assert(run_measurement::program_stopped(fake_millis, elapsed));
  assert(elapsed == 250U);
}

static void test_measure_is_cancelled_by_new_root_error_cancel_and_reinit(void) {
  reset_host();
  add_script("ARM", "measure\n");
  add_script("PLAIN", "ok\n");
  assert(m61_text::load_program("ARM"));
  assert(run_measurement::state() == run_measurement::State::ARMED);
  assert(m61_text::load_program("PLAIN"));
  assert(run_measurement::state() == run_measurement::State::IDLE);

  assert(m61_text::load_program("ARM"));
  m61_text::cancel();
  assert(run_measurement::state() == run_measurement::State::IDLE);

  add_script("FAIL_AFTER_ARM", "measure\nbad\n");
  assert(!m61_text::load_program("FAIL_AFTER_ARM"));
  assert(run_measurement::state() == run_measurement::State::IDLE);

  add_script("REINIT_AFTER_ARM", "measure\nreinit\n");
  assert(m61_text::load_program("REINIT_AFTER_ARM"));
  assert(run_measurement::state() == run_measurement::State::IDLE);
}

static void test_print_owns_display_until_root_script_finishes(void) {
  reset_host();
  add_script("DISPLAY", "print \"frame\"\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_print_off_and_on_control_display_ownership(void) {
  reset_host();
  add_script("DISPLAY", "print off\nrun\nprint on\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(!m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_trap_wait_holds_snapshot_and_resumes_at_deadline(void) {
  reset_host();
  add_script("WAIT", "trap 10 run :frame\nrun\nret\n:frame\nprint \"frame\"\nwait 500\nret\n");
  assert(m61_text::load_program("WAIT"));
  assert(fire_program_boundary(10, 0x02));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(m61_text::display_owned());
  assert(context_saves == 1);
  assert(context_restores == 0);

  fake_millis = 499;
  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(context_restores == 0);

  fake_millis = 500;
  m61_text::service();
  assert(!m61_text::calculator_suspended());
  assert(context_restores == 1);
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_trap_ret_preserves_user_angle_change(void) {
  reset_host();
  add_script("ANGLE",
             "trap 10 run :frame\n"
             "run\n"
             "ret\n"
             ":frame\n"
             "wait 500\n"
             "ret\n");
  MK61Emu_SetAngleUnit(DEGREE);
  assert(m61_text::load_program("ANGLE"));
  assert(fire_program_boundary(10));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(MK61Emu_GetAngleUnit() == DEGREE);

  // Имитируем Р, нажатую на физической клавиатуре во время показа кадра.
  MK61Emu_SetAngleUnit(RADIAN);
  fake_millis = 500;
  m61_text::service();

  assert(!m61_text::calculator_suspended());
  assert(context_restores == 1);
  assert(MK61Emu_GetAngleUnit() == RADIAN);
  m61_text::cancel();
}

static void test_trap_handler_can_call_a_common_label(void) {
  reset_host();
  add_script("CALL",
             "trap 10 run :frame\n"
             "run\n"
             "ret\n"
             ":frame\n"
             "run :common\n"
             "print \"bee\"\n"
             "ret\n"
             ":common\n"
             "print \"ansi\"\n"
             "ret\n");
  assert(m61_text::load_program("CALL"));
  assert(fire_program_boundary(10));

  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(executed_lines.size() == 6);
  assert(executed_lines[1] == "run :common");
  assert(executed_lines[2] == "print \"ansi\"");
  assert(executed_lines[3] == "ret");
  assert(executed_lines[4] == "print \"bee\"");
  assert(executed_lines[5] == "ret");
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_nested_script_returns_to_parent_and_depth_is_bounded(void) {
  reset_host();
  add_script("PARENT", "open CHILD\nbad\n");
  add_script("CHILD", "ok\n");
  assert(m61_text::load_program("PARENT"));
  assert(m61_text::active());
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "PARENT") == 0);
  assert(error.line == 2);

  reset_host();
  add_script("RECURSE", "open RECURSE\n");
  assert(m61_text::load_program("RECURSE"));
  assert(m61_text::active());
  m61_text::service();
  const m61_text::Error depth_error = require_error();
  assert(std::strcmp(depth_error.script, "RECURSE") == 0);
  assert(depth_error.line == 1);
  assert(!m61_text::active());
}

static void test_explicit_id_disambiguates_directory_names(void) {
  reset_host();
  add_script("SAME", "bad\n", 10);
  add_script("SAME", "ok\n", 20);
  assert(m61_text::load_program((u16) 1));
  assert(executed_commands == 1);
  assert(!m61_text::active());
  m61_text::Error error = {};
  assert(!m61_text::last_error(error));
}

static void test_trap_saves_runs_and_restores_at_exact_address(void) {
  reset_host();
  add_script(
      "TRAP",
      "trap 10 run :message\n"
      "run\n"
      "ret\n"
      ":message\n"
      "print \"AT 10: X={X}\\r\\n\"\n"
      "ret\n");

  assert(m61_text::load_program("TRAP"));
  assert(m61_text::active());
  assert(m_IK1302.comma == core_61::COMMA_RUN_POSITION);
  assert(!fire_program_boundary(9, 0x01));
  assert(fire_program_boundary(10, 0x02));
  assert(m61_text::calculator_suspended());

  m61_text::service();
  assert(context_saves == 1);
  assert(context_restores == 1);
  assert(!m61_text::calculator_suspended());
  assert(executed_lines.size() == 3);
  assert(executed_lines[0] == "run");
  assert(executed_lines[1].rfind("print ", 0) == 0);
  assert(executed_lines[2] == "ret");
  assert(!executed_in_trap[0]);
  assert(executed_in_trap[1] && executed_in_trap[2]);

  // Восстановление точного контекста до команды снова встречает адрес 10.
  // Первая встреча — однократное продолжение; последующий цикл может снова
  // попасть в ловушку.
  assert(!fire_program_boundary(10, 0x02));
  assert(fire_program_boundary(10, 0x02));
  m61_text::service();
  assert(context_saves == 2 && context_restores == 2);
  assert(!fire_program_boundary(10, 0x02));

