bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
static void test_reinit_continues_script_and_clears_handlers(void) {
  reset_host();
  add_script(
      "REINIT",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "reinit\n"
      "ok\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("REINIT"));
  assert(reinit_count == 1);
  assert(!m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(executed_lines.size() == 3);
  assert(executed_lines[0] == "reinit");
  assert(executed_lines[1] == "ok");
  assert(executed_lines[2] == "ret");
}

static void test_manual_clear_stops_bind_and_trap_watcher(void) {
  reset_host();
  add_script(
      "CLEAR",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("CLEAR"));
  assert(m61_text::active());
  assert(boundary_hook != nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(m61_text::clear_bindings_and_traps());
  assert(!m61_text::active());
  assert(!m61_text::calculator_suspended());
  assert(boundary_hook == nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(fire_mk61_command(0xAE) == 0xAE);
  assert(!m61_text::clear_bindings_and_traps());
}

static void test_bind_and_trap_survive_program_stop(void) {
  reset_host();
  add_script(
      "PERSIST",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "run\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("PERSIST"));
  assert(m61_text::active());
  assert(m_IK1302.comma == core_61::COMMA_RUN_POSITION);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  // Штатный останов программы только продолжает сценарий до корневого ret.
  // Активные обработчики переводят его в WATCH_EVENTS, а не очищаются.
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(boundary_hook != nullptr);
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(fire_mk61_command(0xAE) == (u8) MK61_NOP);
  m61_text::service();
  assert(m61_text::active());

  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_manual_clear_preserves_running_script(void) {
  reset_host();
  add_script(
      "CONTINUE",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "wait 500\n"
      "ok\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("CONTINUE"));
  assert(m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(m61_text::clear_bindings_and_traps());
  assert(m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(!fire_program_boundary(10));

  fake_millis = 500;
  m61_text::service();
  assert(!m61_text::active());
  assert(boundary_hook == nullptr);
  assert(executed_lines.back() == "ret");
}

static void test_manual_clear_inside_trap_restores_context(void) {
  reset_host();
  add_script(
      "TRAPCLEAR",
      "trap 10 run :trapped\n"
      "ret\n"
      ":trapped\n"
      "wait 500\n"
      "ret\n");
  assert(m61_text::load_program("TRAPCLEAR"));
  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(context_saves == 1);

  assert(m61_text::clear_bindings_and_traps());
  assert(m61_text::calculator_suspended());
  fake_millis = 500;
  m61_text::service();
  assert(context_restores == 1);
  assert(!m61_text::calculator_suspended());
  assert(!m61_text::active());
  assert(boundary_hook == nullptr);
}

static void test_ret_returns_from_nested_script_and_ends_root(void) {
  reset_host();
  add_script("PARENT", "open CHILD\nbad\n");
  add_script("CHILD", "ret\nbad\n");
  assert(!m61_text::load_program("PARENT"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "PARENT") == 0);
  assert(error.line == 2);

  reset_host();
  add_script("ROOTRET", "ret\nbad\n");
  assert(m61_text::load_program("ROOTRET"));
  assert(!m61_text::active());
  assert(executed_commands == 1);
  m61_text::Error no_error = {};
  assert(!m61_text::last_error(no_error));
}

int main(void) {
  test_command_failure_reports_script_and_line();
  test_long_missing_name_is_truncated_to_error_capacity();
  test_duplicate_and_oversized_labels_fail_before_execution();
  test_line_limit_is_enforced_during_indexing();
  test_indexed_loop_is_budgeted_and_uses_block_reads();
  test_label_reference_rejects_trailing_tokens();
  test_run_waits_and_reports_later_failure();
  test_measure_arms_next_manual_run_after_script_finishes();
  test_measure_preceding_run_starts_at_the_run_boundary();
  test_measure_is_cancelled_by_new_root_error_cancel_and_reinit();
  test_print_owns_display_until_root_script_finishes();
  test_print_off_and_on_control_display_ownership();
  test_trap_wait_holds_snapshot_and_resumes_at_deadline();
  test_trap_ret_preserves_user_angle_change();
  test_trap_handler_can_call_a_common_label();
  test_nested_script_returns_to_parent_and_depth_is_bounded();
  test_explicit_id_disambiguates_directory_names();
  test_trap_saves_runs_and_restores_at_exact_address();
  test_trap_is_activated_only_when_its_line_executes();
  test_restarting_same_root_preserves_active_traps();
  test_invalid_traps_fail_before_or_at_run();
  test_trap_handler_requires_ret_and_restores_on_error();
  test_bind_consumes_keyboard_opcode_and_calls_handler();
  test_bind_is_validated_and_activated_only_when_executed();
  test_bind_handler_requires_ret();
  test_bind_limit_and_non_reentrant_handler();
  test_reinit_continues_script_and_clears_handlers();
  test_manual_clear_stops_bind_and_trap_watcher();
  test_bind_and_trap_survive_program_stop();
  test_manual_clear_preserves_running_script();
  test_manual_clear_inside_trap_restores_context();
  test_ret_returns_from_nested_script_and_ends_root();
  std::printf("m61_text_self_test: ok\n");
  return 0;
}
